# Taps

tap "romkatv/powerlevel10k"
tap "homebrew/cask-fonts"

# Brews
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "git-interactive-rebase-tool"
brew "gh"
brew "glow"
brew "yadm"
brew "exa"
brew "git"
brew "jq"
brew "fzf"
brew "bat"

brew "powerlevel10k"

# Casks
cask "google-chrome"
cask "iterm2" 
cask "1password"
cask "alfred"
cask "visual-studio-code"
cask "signal"
cask "whatsapp"

# Fonts
cask 'font-meslo-lg-nerd-font'
cask "font-meslo-for-powerline"
cask "font-fira-mono-nerd-font"

# AppStore
brew "mas"

mas  "Telegram", id: 747648890
